using Android.App;
using Android.Content;
using Android.OS;
using Android.Runtime;
using Android.Views;
using Android.Widget;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace AzkaryApp.Models
{
    public class AzkarHeeg
    {
        public string ZekrName { get; set; }
        public int ZekrCount { get; set; }
        public int ZekrId { get; set; }


    }
    public class AzkarHeegData
    {
        private List<AzkarHeeg> azkarHeegs = new List<AzkarHeeg>()
       {
           new AzkarHeeg()
           {
               ZekrId = 1,
               ZekrCount= 1,
               ZekrName="  كَيْفَ يُلَبِّي المُحْرِمُ فِي الْحَجِّ أَوِ الْعُمْرَةِ : "
               +"(لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ)"
           },

           new AzkarHeeg()
           {
               ZekrId = 2,
               ZekrCount= 1,
               ZekrName=" التَّكْبــِيرُ إِذَا أَتَى الْحَجَرَ الأَسْوَدَ "
               +" (طَافَ النَّبيُّ - صلى الله عليه وسلم - بِالْبَيْتِ عَلَى بَعِيرٍ كُلَّمَا أَتَى الرُّكْنَ أَشَارَ إِلَيْهِ بِشَيْءٍ عِنْدَهُ وَكَبَّرَ)"
           },
             new AzkarHeeg()
           {
               ZekrId = 3,
               ZekrCount= 1,
               ZekrName="الدُّعَاءُ بَيْنَ الرُّكْنِ الْيَمَانِيِّ وَالْحَجَرِ الأَسْوَدِ"
                 +"  (رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ)"
           },
               new AzkarHeeg()
           {
               ZekrId = 4,
               ZekrCount= 3,
               ZekrName=" دُعَاءُ الْوُقُوفِ عَلَى الصَّفَا وَالمَرْوَةِ "
                   +" (لَمَّا دَنَا النَّبِيُّ - صلى الله عليه وسلم - مِنَ الصَّفَا قَرَأَ: إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ، فَاسْتَقْبَلَ الْقِبْلَةَ، فَوَحَّدَ اللَّهَ وَكبَّرَهُ وَقَالَ: (لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذلكَ. قَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ) الْحَدِيثُ. وَفِيهِ: (فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا)"
           },
                 new AzkarHeeg()
           {
               ZekrId = 5,
               ZekrCount= 1,
               ZekrName="الدُّعَـــــاءُ يَــــوْمَ عَـــــرَفَةَ"
                     +"( قَالَ النَّبِيُّ - صلى الله عليه وسلم -: (خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ، وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبيُّونَ مِنْ قَبْلِي: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ)"
                 }
                     ,
                   new AzkarHeeg()
           {
               ZekrId = 6,
               ZekrCount= 1,
               ZekrName="الذِّكْـــرُ عِنْــدَ الـمَشْـــعَرِ الْحَرَامِ"
                       +" (رَكِبَ النَّبِيُّ - صلى الله عليه وسلم - الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ (فَدَعَاهُ، وَكَبَّرَهُ، وَهَللَّهُ، وَوَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفاً حَتَّى أَسْفَرَ جِدَّاً فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمسُ)"
           },
                     new AzkarHeeg()
           {
               ZekrId = 7,
               ZekrCount= 1,
               ZekrName="التَّكْبِيرُ عِنْدَ رَمْي الْجِمَارِ مَعَ كُلِّ حَصَاةٍ"
                         +"  (يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الْجِمَارِ الثَّلاَثِ، ثُمَّ يَتَقَدَّمُ، ويَقِفُ يَدْعُو مُسْتَقْبِلَ الْقِبلَةِ، رَافِعاً يَدَيْهِ بَعْدَ الْجَمْرَةِ الْأُولَى وَالثَّانِيَةِ. أَمَّا جَمْرَةُ الْعَقَبَةِ فَيَرْمِيهَا وَيُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ وَيَنْصَرِفُ وَلاَ يَقِفُ عِنْدَهَا). "
           },
                       new AzkarHeeg()
           {
               ZekrId = 8,
               ZekrCount= 1,
               ZekrName=" مَا يَقُولُ عِنْدَ الذَّبْحِ أَوِ النَّحْرِ "
                           +" (بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ وَلَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي)"
           }



       };

        public List<AzkarHeeg> AzkarHeegs { get => azkarHeegs; set => azkarHeegs = value; }
    }
}